---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SweepFailures.CannotDrawSweep
source: html/122c4015-0471-ebf5-0f55-7618c1ff2b3a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SweepFailures.CannotDrawSweep Property

Can't create sweep.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawSweep { get; }
```